# l = 2*3.14*3
# s = 3.14*3**2
# print("周长为:%.2f,面积为:%.2f" % (l,s))

# s = 100 // 9
# i = 100 % 9
# print("能买%d斤，找零%d元" % (s,i))


# s = 23 * 365
# i = s // 7
# print("过了%d个星期天" % (i))
 

#66666

# h = 66666 // 3600
# m = (66666 % 3600) // 60
# s = 66666 % 3600 % 60
# print("现在时间是%d时%d分%d秒" % (h,m,s))

# print("  *")
# print(" ***")
# print("*****")
# print(" ***")
# print("  *" )



# s = 216 // 16
# i = (216 % 16) * 0.625
# print("是古代的%d斤%d两" % (s,i))




# 摄氏温度 = 5.0/9.0*(100-32)
# 开氏温度 = 摄氏温度+273.15
# print("摄氏温度为%.2f,开氏温度为%.2f" % (摄氏温度,开氏温度))